[
    {
        "content": "<p>I want to welcome you to <strong>DAT206x: Excel for Data Analysis and Visualization</strong>. My name is Jonathan Sanito. I work as a content developer for Microsoft, and I'll be your host for this course.&nbsp;</p>\n<p>To help ensure that your learning experience is good, please note that you need to have an installation of Microsoft Excel on a Windows machine for this course. This course is developed using Excel 2016, but you can follow the course along using Excel 2013 and 2010 to some extend. If you do not have Excel installed, we have listed a couple of options in the <a href=\"https://courses.edx.org/courses/course-v1:Microsoft+DAT206x+2T2016/courseware/a6ee34e76a2647e8b77ecf410d4d361d/0dc7a64025ae4767a0759c52a5aece06/\" target=\"[object Object]\">Set up the Lab Environment</a>&nbsp;section. We definitely recommend that you install Office 2016 preview</a>&nbsp;and try Excel 2016.&nbsp;</p>\n<p>Excel is one of the most widely used solutions for analyzing and visualizing data. Beginning with Excel 2010, new tools were introduced to enable the analysis of more data, to improve visualizations and to enable more sophisticated business logic.</p>\n<p>In this course, you will learn about latest versions of these tools in Excel 2016. You will see how to import data from different sources, create mashups between data sources, and prepare the data for analysis. You will learn about how business calculations&mdash;from simple to more advanced&mdash;can be expressed using the DAX calculation engine. You will also learn how the data can be visualized in Excel and shared to the Power BI cloud service.</p>\n<p>To get started, view the Courseware page and view the topics in <a href=\"https://courses.edx.org/courses/course-v1:Microsoft+DAT206x+2T2016/courseware/a6ee34e76a2647e8b77ecf410d4d361d/1972a7ff9ef343e18d6d5b2ecb7eb868/\" target=\"[object Object]\">Start Here</a>, which will help you learn how to navigate the course content and get oriented with what to expect.</p>\n<p>The course will take an estimated 2-4 hours per week for four weeks, including lecture, quizzes, lab exercises, and further reading. All quizzes and lab exercises are graded. Quizzes account for 30% of the total grade, the lab exercises accounts for 65% of the total grade, and the two mandatory surveys account for the remaining 5%. You must achieve an overall score of 65% to pass the course. The deadlines for all graded components are set to October 26th, 23:30 UTC. So if you are just joining us now, it is not too late to try and complete the course and earn a verified certificate.</p>\n<p>We welcome your feedback, so if something is confusing or doesn't work the way you expect, let us know and we'll do our best to address it. Please use the <a href=\"https://courses.edx.org/courses/course-v1:Microsoft+DAT206x+2T2016/discussion/forum/course/threads/55fbdd479714b0e00a001bc3\" target=\"[object Object]\">discussion</a>&nbsp;board to introduce yourself and let us know how you're doing.</p>\n<p>Welcome and thanks for taking this course from Microsoft.</p>\n<p>Jonathan and the DAT206x Course Staff.</p>", 
        "date": "September 29, 2015", 
        "id": 1, 
        "status": "deleted"
    }, 
    {
        "content": "<p>We are in Week 2!</p>\n<p>The response to the course has been phenomenal and we really appreciate all the enthusiasm to learn and contribute. We&rsquo;re so encouraged to see the amount of students enrolled, actively completing the exercises and participating in the discussion forums. We hope that you are enjoying this course as much as we do developing it.</p>\n<p><strong>Community TA</strong></p>\n<p>The DAT206x course staff welcome <strong>WLitzenberg</strong> as a community Teaching Assistant (TA). <strong>WLitzenberg</strong> has been very active in the discussion forum, helping fellow students, providing good guidance where needed. We&rsquo;re glad to have him as our community TA.<br />With the huge amount of students enrolled in this course, please understand that not every questions can be answered by the course staff and TA. We appreciate that a lot of you are actively helping your peers. Community is one of the aspect that makes learning experience great!<br />While we continue to encourage you to use the discussion forums, please do not post quiz answers and actual code in the forum. I&rsquo;m sure we all can ask questions and give feedback without taking the opportunity to learn from others.</p>\n<p><strong>Schedule</strong></p>\n<p>Module 3 and 4 have been released since Tuesday. This week, we cover multiple ways of bringing data into Excel data model and perform data mash ups.<br />If you&rsquo;re just joining us, do note that all deadlines for the graded coursework are set to October 26th, 23:30 UTC.</p>\n<p><strong>Issues and Feedback</strong></p>\n<p>There were several issues identified during the first week and the last couple of days pertaining to Excel versioning and system locale. Thank you for bringing these to our attention. For those of you with Excel 2010, you should now be able to complete the course with the alternative files provided. For those of you with Non ProPlus edition (be it 2013 or 2016), I believe your fellow student has provided an excellent workaround - kudos to <strong>LeonidasT</strong> for the post.</p>\n<p>Have fun!</p>\n<p>Jonathan and the DAT206x Course staff</p>\n<p></p>", 
        "date": "October 8, 2015", 
        "id": 2, 
        "status": "deleted"
    }, 
    {
        "content": "<p>I hope you&rsquo;re enjoying the course so far!</p>\n<p>Both module 5 and 6 have now been released. <br />This week we'll learn how to create measures, filter context for calculation, and explore several advanced DAX functions. We'll also cover a very common scenario which is to import data from a formatted Excel report. <br /><strong>&nbsp;</strong><br /><strong>Discussion Forum</strong><br />This week we welcome <strong>wjameswilliams</strong> as our new community TA. I&rsquo;m sure by now you have seen him around the forum, answering questions. I also want to give another shout-out to <strong>WLitzenberg</strong> for all his effort helping fellow students. I want continue to encourage everyone to actively use the&nbsp;<a href=\"https://courses.edx.org/courses/course-v1:Microsoft+DAT206x+2T2016/discussion/forum\" target=\"[object Object]\"><span style=\"color: #0066cc;\" color=\"#0066cc\">forum</span></a> to ask questions, give feedback, and even help your fellow learners.</p>\n<p><strong>Verified Certificate</strong><br />If you plan to use this course for job applications, promotions, or school applications, you may prefer to have a verified certificate. An edX verified certificate shows that you have successfully completed your edX course and verifies your identity through your photo and ID.&nbsp; It&rsquo;s also a great way to give yourself an incentive to complete the course and celebrate your success. There is still time to upgrade for a&nbsp;<a href=\"https://courses.edx.org/verify_student/upgrade/course-v1:Microsoft+DAT206x+2T2016/\" target=\"[object Object]\"><span style=\"color: #0066cc;\" color=\"#0066cc\">verified certificate</span></a> for this course, if you haven&rsquo;t done so already! You can read more about&nbsp;<a href=\"https://www.edx.org/verified-certificate\" target=\"[object Object]\"><span style=\"color: #0066cc;\" color=\"#0066cc\">certificates</span></a> here.</p>\n<p>Have fun!</p>\n<p>Jonathan and the DAT206x Course staff<br /></p>", 
        "date": "October 15, 2015", 
        "id": 3, 
        "status": "deleted"
    }, 
    {
        "content": "    <p><img height=\"200px\" alt=\"DAT206x: Analyzing and Visualizing Data with Excel\" src=\"/static/Excel2.png\" type=\"saveimage\" target=\"[object Object]\" /></p>\n    <p><strong>Welcome to DAT206x: Analyzing and Visualizing Data with Excel!</strong></p>\n    <p>I want to welcome you to DAT206x: Analyzing and Visualizing Data with Excel. My name is Jonathan Sanito. I work as a content developer for Microsoft, and I'll be your host for this course.</p>\n    <p>Excel is one of the most widely used solutions for analyzing and visualizing data. Beginning with Excel 2010, new tools were introduced to enable the analysis of more data, to improve visualizations and to enable more sophisticated business logic. In this course, you will learn about latest versions of these tools in Excel 2016. You will see how to import data from different sources, create mashups between data sources, and prepare the data for analysis. You will learn about how business calculations&mdash;from simple to more advanced&mdash;can be expressed using the DAX calculation engine. You will also learn how the data can be visualized in Excel and shared to the Power BI cloud service.</p>\n    <p>To get started, view the Course page and view the topics in <strong>Start Here!</strong>, which will help you learn how to navigate the course content and get oriented with what to expect.&nbsp;</p>\n    <p>To get the most out of this course, please check out the <strong>Set up the Lab Environment</strong> section, and ensure you have the required system requirements.</p>\n    <p></p>\n    <p><strong>Self-Paced Format</strong></p>\n    <p>The course is designed for self-paced study of around <strong>2-4 hours per week</strong> for <strong>six weeks</strong>, including lectures, quizzes, labs and further readings. All quizzes and lab exercises are graded. The quizzes account for <strong>30%</strong> of the total grade, the lab exercises accounts for<strong> 65%</strong> of the total grade, and the mandatory survey accounts for the remaining <strong>5%</strong>. You must achieve an overall score of <strong>70%</strong> to pass the course.</p>\n    <p>You can listen to the lecture, attempt the quizzes, and work on the labs exercises at anytime prior to the course end date on the Home page. In the quizzes/labs, you have between one to four&nbsp;maximum attempts at each question, depending on the type of the question.</p>\n    <p><strong>Certificate</strong></p>\n    <p>The course offers Verified Certificates. If you plan to use this course for job applications, promotions, or school applications, you may prefer to have a verified certificate. An edX verified certificate shows that you have successfully completed your edX course and verifies your identity through your photo and ID. It's also a great way to give yourself an incentive to complete the course and celebrate your success.</p>\n    <p>You can check your progress on the <strong>Progress</strong> page. If you signed up for verified certificate, when you have achieved the passing grade, you can click the <strong>Request Certificate</strong> button to receive your certificate.</p>\n    <p><strong>Discussion Forum</strong></p>\n    <p>We welcome your feedback, so if something is confusing or doesn't work the way you expect, let us know and we'll do our best to address it. Please use the <a href=\"https://courses.edx.org/courses/course-v1:Microsoft+DAT206x+4T2016/discussion/forum\" target=\"[object Object]\">discussion</a>&nbsp;board to introduce yourself and let us know how you're doing. I want continue to encourage everyone to actively use the forum to ask questions, give feedback, and even help your fellow learners. However, please do not post quiz answers and actual code in the forum. I&rsquo;m sure we all can ask questions and give feedback without taking the opportunity to learn from others.</p>\n    <p><strong>Community TAs</strong></p>\n    <p>Teaching Assistants (TAs) are here to help students, provide guidance, and moderate the discussion forum. With the huge amount of students enrolled in this course, please understand that not every questions can be answered by the course staff and TA. We appreciate that a lot of you are actively helping your peers. Community is one of the aspect that makes learning experience great!</p>\n", 
        "date": "July 18, 2016", 
        "id": 4, 
        "status": "visible"
    }
]